; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :typing :equality)
    (:types
        block - object
    )

    (:constants
        
    )

    (:predicates
        (on ?x1 - block ?x2 - block)
        (ontable ?x1 - block)
        (clear ?x1 - block)
        (handempty )
        (holding ?x1 - block)
    )

    (:functions
        
    )

    

    
    (:action pick-up
     :parameters (?x - block)
     :precondition (and (clear ?x) (ontable ?x) (handempty ))
     :effect (and
        (holding ?x)
        (not (ontable ?x))
        (not (clear ?x))
        (not (handempty )))
    )


    (:action put-down
     :parameters (?x - block)
     :precondition (holding ?x)
     :effect (and
        (clear ?x)
        (handempty )
        (ontable ?x)
        (not (holding ?x)))
    )


    (:action stack
     :parameters (?x - block ?y - block)
     :precondition (and (holding ?x) (clear ?y))
     :effect (and
        (clear ?x)
        (handempty )
        (on ?x ?y)
        (not (holding ?x))
        (not (clear ?y)))
    )


    (:action unstack
     :parameters (?x - block ?y - block)
     :precondition (and )
     :effect (and
        (holding ?x)
        (clear ?y)
        (not (clear ?x))
        (not (handempty ))
        (not (on ?x ?y)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        a b c d - block
    )

    (:init
        (clear b)
        (ontable d)
        (on a d)
        (on b c)
        (on c a)
        (handempty )
    )

    (:goal
        (and (on d c) (on a b) (on c a))
    )

    
    
    
)

; plan
1. (unstack a a)
   deleted: (handempty)
   added: (holding a) (clear a)
   goals met: 1 of 3
2. (unstack d c)
   added: (holding d) (clear c)
   goals met: 1 of 3
3. (stack a b)
   deleted: (holding a) (clear b)
   added: (handempty) (on a b)
   goals met: 2 of 3
4. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (on d c)
   goals met: 3 of 3
